Autodesk.Revit.DB.ModifierType
Since:
2014
An enumerated type listing options to appear in the exported layer name.
Since:
2014

Autodesk.Revit.DB.ModifierType.FabricationService
Signals that the fabrication service will appear in the layer name.

Autodesk.Revit.DB.ModifierType.DomainType
Signals that the domain type will appear in the layer name.

Autodesk.Revit.DB.ModifierType.SystemClassification
Signals that the system classification will appear in the layer name.

Autodesk.Revit.DB.ModifierType.AnalyzesAs
Signals that the value of the AnalyzesAs parameter will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Workset
Signals that the name of the workset will appear in the layer name.

Autodesk.Revit.DB.ModifierType.ViewType
Signals that the view type will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Underlay
Signals that the name of the underlay will appear in the layer name.

Autodesk.Revit.DB.ModifierType.SystemType
Signals that the system type will appear in the layer name.

Autodesk.Revit.DB.ModifierType.SystemName
Signals that the system name will appear in the layer name.

Autodesk.Revit.DB.ModifierType.StructuralUsage
Signals that the value of structural usage will appear in the layer name.

Autodesk.Revit.DB.ModifierType.StructuralMaterialType
Signals that the value of structural material type will appear in the layer name.

Autodesk.Revit.DB.ModifierType.PhaseStatus
Signals that the value of of phase status will appear in the layer name.

Autodesk.Revit.DB.ModifierType.PhaseDemolished
Signals that the name of the demolition phase will appear in the layer name.

Autodesk.Revit.DB.ModifierType.PhaseCreated
Signals that the name of the created phase will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Level
Signals that the name of the level will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Function
Signals that the value of function will appear in the layer name.

Autodesk.Revit.DB.ModifierType.FireRating
Signals that the value of fire rating will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Custom3
Signals that the third custom string will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Custom2
Signals that the second custom string will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Custom1
Signals that the first custom string will appear in the layer name.

Autodesk.Revit.DB.ModifierType.Category
Signals that the name of the category will appear in the layer name.

Autodesk.Revit.DB.ModifierType.UnknownType
An unknown (default) type of modifier, not acceptable for assignment.